# Вывести максимальную и минимальную цену книг каждого автора, кроме Есенина, количество экземпляров книг которого больше 10.
SELECT author,
       MIN(price) AS Минимальная_цена,
       MAX(price) AS Максимальная_цена
  FROM book
 WHERE author <> 'Есенин С.А.'
 GROUP BY author
HAVING SUM(amount) > 10;

# Посчитать стоимость всех экземпляров каждого автора без учета книг «Идиот» и «Белая гвардия». В результат включить только тех авторов, у которых суммарная стоимость книг (без учета книг «Идиот» и «Белая гвардия») более 5000 руб. Вычисляемый столбец назвать Стоимость. Результат отсортировать по убыванию стоимости.
SELECT author,
       SUM(amount * price) AS Стоимость
  FROM book
 WHERE title <> 'Идиот'
   AND title <> 'Белая гвардия'
#  WHERE title NOT IN ('Идиот', 'Белая Гвардия')
 GROUP BY author
HAVING Стоимость > 5000
 ORDER BY Стоимость DESC;